# IsInXRayMode Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Form..::..IsInXRayMode Property
Form Class See Also
---
Get/set if the form is in X-Ray mode.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsInXRayMode { get; set; }
```

Visual Basic
---
```text
Public Property IsInXRayMode As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool IsInXRayMode {
	bool get ();
	void set (bool value);
}
```

# See Also
Form Class
Autodesk.Revit.DB Namespace